---
title: CircuitNamingSchemeSettings
classe: Autodesk.Revit.DB.Electrical.CircuitNamingSchemeSettings
namespace: Autodesk.Revit.DB.Electrical
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# CircuitNamingSchemeSettings

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ElementId CircuitNamingSchemeId { get; set; }` | `circuitNamingSchemeSettings.CircuitNamingSchemeId` | ElementId |
| `CircuitNamingSchemeSettings GetCircuitNamingSchemeSettings(Document)` | `CircuitNamingSchemeSettings.GetCircuitNamingSchemeSettings(cda)` | CircuitNamingSchemeSettings |
| `Boolean IsValidCircuitNamingSchemeId(Document, ElementId)` | `CircuitNamingSchemeSettings.IsValidCircuitNamingSchemeId(aDocument, circuitNamingSchemeId)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```